# AddAssociation Method (ISet(ElementId), ISet(ElementId)) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalToPhysicalAssociationManager..::..AddAssociation Method (ISet<(Of <(<'ElementId>)>)>, ISet<(Of <(<'ElementId>)>)>)
AnalyticalToPhysicalAssociationManager Class See Also
---
Adds a new association between a group of analytical elements and a group of physical elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public void AddAssociation(
	ISet<ElementId> analyticalElementIds,
	ISet<ElementId> physicalElementIds
)
```

Visual Basic
---
```text
Public Sub AddAssociation ( _
	analyticalElementIds As ISet(Of ElementId), _
	physicalElementIds As ISet(Of ElementId) _
)
```

Visual C++
---
```text
public:
void AddAssociation(
	ISet<ElementId^>^ analyticalElementIds,
	ISet<ElementId^>^ physicalElementIds
)
```

# ### Parameters
analyticalElementIds
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> Ids of the analytical elements.
physicalElementIds
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> Ids of the physical elements.
# Remarks
The arguments must be ids of analytical and of physical elements that don't have other associations, otherwise an exception is thrown. Physical elements can have one of these categories:
  * Columns
  * Curtain Wall Panels
  * Floors
  * Generic Models
  * Mass
  * Parts
  * Railings
  * Ramps
  * Roofs
  * Stairs
  * Structural Columns
  * Structural Foundation
  * Structural Framing
  * Structural Trusses
  * Structural Beam System
  * Walls

Analytical elements can have one of these categories:
  * Analytical Member
  * Analytical Panel

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Analytical id is not valid or has already defined another association. -or- Physical id is not valid or has already defined another association. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalToPhysicalAssociationManager Class
AddAssociation Overload
Autodesk.Revit.DB.Structure Namespace